app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.all.order("created_at desc").page(params[:page]).per(10)

SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? LIMIT 10 OFFSET 0  [["article_id", 56]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 56]]
---
  def show
    @comments = @article.comments.page(params[:page]).per(10)

SELECT  "comments".* FROM "comments"  ORDER BY "comments"."id" ASC LIMIT 1
UPDATE "articles" SET "text" = '12', "updated_at" = '2015-10-26 13:37:16.212417', "lock_version" = 1 WHERE "articles"."id" = ? AND "articles"."lock_version" = ?  [["id", 57], ["lock_version", 0]]
UPDATE "comments" SET "text" = 'qqq', "updated_at" = '2015-10-27 02:38:13.628426', "lock_version" = 3 WHERE "comments"."id" = ? AND "comments"."lock_version" = ?  [["id", 1], ["lock_version", 2]]
---
  def update
    comment = Comment.first
    comment.update_attributes(text:params[:article][:text])

INSERT INTO "articles" ("name", "text", "created_at", "updated_at", "lock_version") VALUES (?, ?, ?, ?, ?)  [["name", "aa"], ["text", "aa"], ["created_at", "2015-10-26 13:34:02.813330"], ["updated_at", "2015-10-26 13:34:02.813330"], ["lock_version", 0]]
---
  def create
    @article = Article.new(article_params)
    if @article.save