app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 56]]
INSERT INTO "comments" ("text", "article_id", "created_at", "updated_at", "lock_version") VALUES (?, ?, ?, ?, ?)  [["text", "safds"], ["article_id", 56], ["created_at", "2015-10-27 03:17:30.140565"], ["updated_at", "2015-10-27 03:17:30.140565"], ["lock_version", 0]]
UPDATE "articles" SET "comments_count" = COALESCE("comments_count", 0) + 1, "lock_version" = COALESCE("lock_version", 0) + 1 WHERE "articles"."id" = ?  [["id", 56]]
---
  def create
    article = Article.find(params[:article_id])
    @comment = article.comments.create(comment_params)
    if @comment.save